Data/Section 5/5.2/Client/VM3_Instance2/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       44523 ops,     525 (avg:     494) ops/sec, 1.86MB/sec (avg: 1.76MB/sec),  3.79 (avg:  4.03) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         247.35          ---          ---      4.00500       256.87
Gets         247.34      1484.04         0.00      4.04800      1544.11
Waits          0.00          ---          ---      0.00000          ---
Totals       494.69      1484.04         0.00      4.02700      1800.98


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.00
SET       1.200         0.06
SET       1.300         0.35
SET       1.400         1.10
SET       1.500         2.78
SET       1.600         5.05
SET       1.700         8.20
SET       1.800        11.89
SET       1.900        15.95
SET       2.000        20.01
SET       2.100        23.84
SET       2.200        27.57
SET       2.300        31.20
SET       2.400        34.26
SET       2.500        37.05
SET       2.600        39.73
SET       2.700        42.06
SET       2.800        44.25
SET       2.900        46.23
SET       3.000        48.01
SET       3.100        49.67
SET       3.200        51.11
SET       3.300        52.35
SET       3.400        53.73
SET       3.500        54.88
SET       3.600        56.00
SET       3.700        57.11
SET       3.800        58.27
SET       3.900        59.46
SET       4.000        60.49
SET       4.100        61.64
SET       4.200        62.84
SET       4.300        63.97
SET       4.400        65.27
SET       4.500        66.37
SET       4.600        67.69
SET       4.700        69.00
SET       4.800        70.25
SET       4.900        71.66
SET       5.000        73.07
SET       5.100        74.40
SET       5.200        75.82
SET       5.300        77.11
SET       5.400        78.39
SET       5.500        79.55
SET       5.600        80.86
SET       5.700        82.05
SET       5.800        83.16
SET       5.900        84.18
SET       6.000        85.26
SET       6.100        86.09
SET       6.200        86.93
SET       6.300        87.66
SET       6.400        88.36
SET       6.500        88.93
SET       6.600        89.52
SET       6.700        90.04
SET       6.800        90.63
SET       6.900        91.10
SET       7.000        91.47
SET       7.100        91.79
SET       7.200        92.11
SET       7.300        92.40
SET       7.400        92.75
SET       7.500        93.06
SET       7.600        93.29
SET       7.700        93.57
SET       7.800        93.81
SET       7.900        94.04
SET       8.000        94.37
SET       8.100        94.62
SET       8.200        94.83
SET       8.300        95.05
SET       8.400        95.23
SET       8.500        95.47
SET       8.600        95.65
SET       8.700        95.86
SET       8.800        96.02
SET       8.900        96.20
SET       9.000        96.35
SET       9.100        96.45
SET       9.200        96.62
SET       9.300        96.77
SET       9.400        96.90
SET       9.500        96.98
SET       9.600        97.04
SET       9.700        97.13
SET       9.800        97.22
SET       9.900        97.32
SET      10.000        97.79
SET      11.000        98.32
SET      12.000        98.63
SET      13.000        98.91
SET      14.000        99.13
SET      15.000        99.32
SET      16.000        99.43
SET      17.000        99.56
SET      18.000        99.64
SET      19.000        99.69
SET      20.000        99.78
SET      21.000        99.82
SET      22.000        99.84
SET      23.000        99.89
SET      24.000        99.90
SET      25.000        99.91
SET      26.000        99.92
SET      27.000        99.93
SET      29.000        99.93
SET      30.000        99.94
SET      33.000        99.94
SET      34.000        99.95
SET      35.000        99.96
SET      41.000        99.96
SET      45.000        99.97
SET      46.000        99.97
SET      50.000        99.98
SET      52.000        99.99
SET      74.000        99.99
SET      87.000       100.00
SET      89.000       100.00
---
GET       1.400         0.03
GET       1.500         0.25
GET       1.600         0.86
GET       1.700         2.30
GET       1.800         4.87
GET       1.900         8.00
GET       2.000        12.24
GET       2.100        16.52
GET       2.200        20.94
GET       2.300        25.46
GET       2.400        29.51
GET       2.500        33.30
GET       2.600        36.68
GET       2.700        40.00
GET       2.800        43.11
GET       2.900        45.54
GET       3.000        47.92
GET       3.100        49.72
GET       3.200        51.46
GET       3.300        53.10
GET       3.400        54.48
GET       3.500        55.84
GET       3.600        57.11
GET       3.700        58.17
GET       3.800        59.27
GET       3.900        60.44
GET       4.000        61.48
GET       4.100        62.46
GET       4.200        63.42
GET       4.300        64.36
GET       4.400        65.35
GET       4.500        66.39
GET       4.600        67.49
GET       4.700        68.51
GET       4.800        69.60
GET       4.900        70.72
GET       5.000        71.82
GET       5.100        73.18
GET       5.200        74.39
GET       5.300        75.56
GET       5.400        77.01
GET       5.500        78.40
GET       5.600        79.70
GET       5.700        81.03
GET       5.800        82.25
GET       5.900        83.58
GET       6.000        84.72
GET       6.100        85.84
GET       6.200        86.78
GET       6.300        87.64
GET       6.400        88.47
GET       6.500        89.25
GET       6.600        89.92
GET       6.700        90.54
GET       6.800        91.06
GET       6.900        91.49
GET       7.000        91.99
GET       7.100        92.30
GET       7.200        92.67
GET       7.300        92.98
GET       7.400        93.24
GET       7.500        93.61
GET       7.600        93.96
GET       7.700        94.23
GET       7.800        94.54
GET       7.900        94.89
GET       8.000        95.10
GET       8.100        95.30
GET       8.200        95.50
GET       8.300        95.74
GET       8.400        95.96
GET       8.500        96.11
GET       8.600        96.29
GET       8.700        96.46
GET       8.800        96.63
GET       8.900        96.72
GET       9.000        96.86
GET       9.100        97.00
GET       9.200        97.15
GET       9.300        97.26
GET       9.400        97.35
GET       9.500        97.46
GET       9.600        97.57
GET       9.700        97.66
GET       9.800        97.76
GET       9.900        97.87
GET      10.000        98.25
GET      11.000        98.69
GET      12.000        98.98
GET      13.000        99.19
GET      14.000        99.34
GET      15.000        99.44
GET      16.000        99.52
GET      17.000        99.59
GET      18.000        99.64
GET      19.000        99.69
GET      20.000        99.73
GET      21.000        99.78
GET      22.000        99.82
GET      23.000        99.83
GET      24.000        99.84
GET      25.000        99.86
GET      26.000        99.87
GET      27.000        99.88
GET      28.000        99.89
GET      30.000        99.89
GET      31.000        99.90
GET      32.000        99.91
GET      33.000        99.92
GET      34.000        99.94
GET      36.000        99.94
GET      37.000        99.95
GET      39.000        99.96
GET      42.000        99.96
GET      46.000        99.96
GET      47.000        99.97
GET      48.000        99.98
GET      52.000        99.98
GET      56.000        99.99
GET      59.000        99.99
GET      63.000       100.00
GET      68.000       100.00
---